// Task 01
// Реализуйте итератор на Number, что бы работала такая конструкция [...3] // [3, 2, 1, 0];

// Task 02
// Наишите функцию-генератор, которая генерирует числа в диапазоне от start до end.

// Task 03
// Создать массив из чисел от 1 до 1000.
// Реализовать функцию-генератор для формирования всех пар из этого массива.
// Результат [1, 1], [1, 2], ..., [2, 1], [2, 2], ..., [1000, 1000]

// Task 04
// Реализуйте функцию генерации чисел Фибоначчи до бесконечности

// Task 05
// Реализуйте функцию-генератор, которая будет генерировать последовательность
// символов от 0 до 9, затем от a до z, затем от A до Z. Воспользуйтесь функцией генератором
// generateSequence, реализованой выше, String.fromCharCode(code), и диапазоном чисел от 48 до 57,
// от 65 до 90 и от 97 до 122

// Task 06
// Создайте-функцию генератор multipleByTwo, которая принимает массив чисел,
// умножает каждое число на 2 и возвращает их по одному
// Создайте-функцию генератор minusOne, которая принимает массив чисел,
// отнимает 1 и возвращает их по одному
// Создайте-функцию генератор isMultipleOfThree, которая принимает массив чисел,
// и возвращает только те, которые делятся на 3 без остатка по одному
// Объявите массив от 0 до 9
// Вызовите первую функцию и передайте ей массив, результат этой функции передайте второй
// а затем результат второй передайтетретей.
// Примените спред оператор к резульату третей функции и создайте массив тех чисел,
// которые останутся