// Опыт
// 0. Рассказать про свой проект
// 1. Виды тестов - unit/snapshot
// 2. Webpack - дописывать/переписывать конфиги
// 3. DevTools Chrome - описать функции и вкладки которые использовал
// 4. NodeJS - основные и типовые задачи какие решал
// 5. Расскажи про свой проект который отдавал на ревью
// 6. Какой интересные идеи тебе удалось пропихнуть на своем проекте
// 7. Что нравится и что не нравится из того с чем работал
// 8. Писал ли на классовых компонентах

// HTML/CSS
// 9. Работал ли с препроцессорами (SASS, SCSS, Less, Styles)
// 10. Как организован CSS в реакте - https://medium.com/@stasonmars/%D1%80%D1%83%D0%BA%D0%BE%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%BE-%D0%BF%D0%BE-%D1%82%D1%80%D1%91%D0%BC-%D1%81%D0%BF%D0%BE%D1%81%D0%BE%D0%B1%D0%B0%D0%BC-%D1%81%D1%82%D0%B8%D0%BB%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D0%B8-%D0%B2-react-2ca5c0c7464b
// 11. БЭМ методология
// 12. Приходилось ли использовать респонсив
// 13. Приходилось ли использовать адаптивность
// 14. Иcпользование семантических тегов HTML
// 15. SEO - какие теги должны использоваться для СЕО опитимизации
// 16. Блочные и строчные элементы
// 17. Как сделать <span> блочным
// 18. Что за проперти flex
// 19. CSS селекторы
// 20. Принципиальное отличие class vs id (приоритет и повторное использование)

// JS
// 21. Что такое контекс (this)
// 22. Потеря контекста (можно перейти на call/apply/bind)
// 23. Можно ли перебиндить уже сбинженый контекст
// 24. Стрелочные функции и кнтекст (использование в качестве callback)
// 25. Что такое прототипы и как они работают

// Серия простых задач
// 26. Как найти подстроку и заменить ее, способы решения (цикл/встроенная функция/регулярное выражение)
// 27. Вывод в консоль логе при объявлении примитивов и объектов

// 28. Event loop
// 29. Классовые и функциональные компоненты отличия
// 30. Какие хуки использовал (писал ли свои кастомные хуки)
// 31. В какой момент времени срабатывает useEffect
// 32. Пустой массив зависимостей в useEffect
// 33. HOC
// 34. TDD, PDD

// 35. Английский
